<template>
  <div class="content">
    <h3>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
    <p>
    Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, расположенной на доменном имени www.tananyeva.com, которую можно получить о Пользователе во время использования  данного сайта, программ и продуктов.
    </p>

    <h3>ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h3>
    <p>
    В настоящей Политике конфиденциальности используются следующие термины:<br>
    «Сайт» — kirillmakeev.ru.
    «Администрация сайта (далее – Администрация сайта, Оператор)» – физическое лицо Макеев Кирилл Сергеевич, которое организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.<br>
    «Персональные данные» – любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).<br>
    «Обработка персональных данных» – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.<br>
    «Конфиденциальность персональных данных» – обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.<br>
    «Форма обратной связи» — html-форма, которую Пользователь заполняет своими персональными данными на сайте, для получения информации об услугах, продуктах и прочее.
    «Пользователь сайта (далее – Пользователь, Субъект персональных данных)» – лицо, имеющее доступ к сайту и/или мобильному приложению, посредством сети Интернет и использующее сайт и/или мобильное приложение.<br>
    «Cookies» – небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.<br>
    «IP-адрес» – уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.<br>
    «Блокирование персональных данных» – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).<br>
    «Распространение персональных данных» – действия, направленные на раскрытие персональных данных неопределенному кругу лиц.<br>
    «Предоставление персональных данных» – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.
    </p>

    <h3>ОБЩИЕ ПОЛОЖЕНИЯ</h3>
    <p>
    Отправка персональных данных через форму обратной связи Пользователем, а также при регистрации на сайте, означает согласие Пользователя на обработку персональных данных, а также согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя. Оформление отдельного согласия на обработку персональных данных Пользователя не требуется.<br>
    В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта.<br>
    Настоящая Политика конфиденциальности применяется только к сайту kirillmakeev.ru. Администрация сайта не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте.<br>
    Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта.
    </p>

    <h3>ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h3>
    <p>
    Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации.<br>
    Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения формы на сайте в соответствующем разделе и включают в себя следующую информацию:<br>
    ФИО Пользователя;<br>
    адрес электронной почты Пользователя;<br>
    номер контактного телефона.<br>
    Администрация сайта осуществляет сбор статистики об IP-адресах и cookie своих посетителей. Данная информация используется с целью выявления и решения технических проблем. Любая иная персональная информация не оговоренная выше подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных главой "Способы и сроки обработки персональной информации" настоящей Политики конфиденциальности.
    </p>

    <h3>ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h3>
    <p>
    Персональные данные Пользователя Администрация сайта может использовать в целях:<br>
    Идентификации Пользователя, для заключения Договора, получения консультации для заключения Договора.<br>
    Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта, оказания услуг, обработка запросов и заявок от Пользователя.<br>
    Обработки и получения платежей, оспаривания платежа. В целях дополнительной защиты от мошеннических действий указанные Пользователем персональные данные могут быть переданы платёжной системе, осуществляющей транзакции по оплате оформленных на Сайте заказов.<br>
    Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием сайта.<br>
    Предоставления Пользователю обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Администрации сайта или от имени партнеров.<br>
    Осуществления рекламной деятельности.<br>
    Предоставления доступа Пользователю на сайты или сервисы партнеров с целью получения продуктов, обновлений и услуг.
    </p>

    <h3>СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h3>
    <p>
    Обработка персональных данных Пользователя осуществляется не дольше срока, отвечающего целям обработки персональных данных, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
    Пользователь соглашается с тем, что Администрация сайта вправе предоставить персональные данные партнерам, другим третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, а также сервису  MailChimp исключительно в целях оказания услуг Пользователю.
    Персональные данные Пользователя могут быть предоставлены уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
    При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.
    Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
    Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
    </p>

    <h3>ОБЯЗАТЕЛЬСТВА СТОРОН</h3>
    <p>
    Пользователь обязан:<br>
    Предоставить информацию о персональных данных, необходимую для пользования сайтом.<br>
    Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.<br>
    Пользователь имеет право отозвать согласие на обработку персональных данных, путем направления уведомления Оператору по адресу электронной почты: me@kirillmakeev.ru. Оператор прекращает обработку персональных данных в сроки установленные действующим законодательством РФ.<br>
    Администрация сайта обязана:<br>
    Использовать полученную информацию исключительно для целей, указанных в главе "Цели сбора персональной информации пользователя" настоящей Политики конфиденциальности.<br>
    Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением главы "Способы и сроки обработки персональной информации" настоящей Политики Конфиденциальности.<br>
    Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, установленному законодательством РФ.<br>
    Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.
    </p>

    <h3>ОТВЕТСТВЕННОСТЬ СТОРОН</h3>
    <p>
    Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных главами "Способы и сроки обработки персональной информации" и "Ответственность сторон" настоящей Политики Конфиденциальности.<br>
    В случае утраты или разглашения персональных данных Администрация сайта не несёт ответственность, если данные персональные данные:<br>
    стали публичным достоянием до их утраты или разглашения.<br>
    были получены от третьей стороны до момента её получения Администрацией сайта.<br>
    были разглашены с согласия Пользователя.
    </p>

    <h3>РАЗРЕШЕНИЕ СПОРОВ</h3>
    <p>
    До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).
    Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
    При недостижении соглашения спор будет передан на рассмотрение в судебный орган по месту нахождения Оператора, в соответствии с действующим законодательством Российской Федерации.
    К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Российской Федерации.
    </p>

    <h3>ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h3>
    <p>
    Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
    Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.
    Все предложения или вопросы по настоящей Политике конфиденциальности следует адресовать на адрес: me@kirillmakeev.ru.
    Действующая Политика конфиденциальности размещена на странице по адресу https://kirillmakeev.ru/confidential.
    </p>
  </div>
</template>

<style scoped>
.content {
  width: 80%;
  margin: 0 auto;
}
</style>